#+TITLE: Document title
#+LANGUAGE: en
#+OPTIONS: toc:nil h:4 html-postamble:nil html-preamble:t tex:t
#+HTML_CONTAINER: div
#+HTML_DOCTYPE: <!DOCTYPE html>
#+HTML_HEAD: <link href="http://fonts.googleapis.com/css?family=Roboto+Slab:400,700|Inconsolata:400,700" rel="stylesheet" type="text/css" />
#+HTML_HEAD: <link href="css/style.css" rel="stylesheet" type="text/css" />

#+LINK: gh    https://github.com/
#+LINK: rfc   https://tools.ietf.org/html/
#+LINK: thing https://github.com/thi-ng/
#+LINK: w3    https://w3.org/TR/
#+LINK: wiki  https://en.wikipedia.org/wiki/

#+HTML: <div class="outline-2" id="meta">
| *Author* | Karsten Schmidt      |
| *Date*   | {{{time(%Y-%m-%d %H:%M:%S)}}}  |
#+HTML: </div>

#+TOC: headlines 3

*** Changes since the last version
    :PROPERTIES:
    :CUSTOM_ID: changelog
    :END:

#+BEGIN_COMMENT
The code block below MUST be manually evaluated by placing the cursor
into the codeblock and typing =C-c C-c=.

In order for the changelog to work, please change the =tag= variable
for the code block below to the tag of your last published version.
#+END_COMMENT

#+HTML: <ul>
#+BEGIN_SRC shell :exports results :results value html :var TAG='v0.0'
RES=`git log $TAG...HEAD --pretty="<li>%s</li>" -- *.org`
if [ -z $RES ]; then
  RES="<li>no changes</li>"
fi
echo $RES
#+END_SRC

#+RESULTS:
#+BEGIN_HTML
<li>no changes</li>
#+END_HTML

#+HTML: </ul>

